In [67]:
print ('Nobre: Luz Arévalo','\nCarnet: 20200392')

import numpy as np
import pandas as pd
heroes_information = pd.read_csv("heroes_information.csv")

Nobre: Luz Arévalo
Carnet: 20200392

In [2]:
###instalar desde anaconda navigator######
####pandasql
####mysql
####mysql-connector-c
####mysql-connector-python
from pandasql import *

In [3]:
####para enlistar los documentos en el directorio#####
os.listdir()

['.ipynb_checkpoints',
 'heroes_information.csv',
 'Lab2_Solución.ipynb',
 'Preguntas.docx']

In [4]:
pysqldf = lambda q: sqldf(q,globals())

In [57]:
##¿Cuál es el nombre del primer superhéroe de la tabla heroes?
P_1 = """
SELECT name 
FROM heroes_information 
limit 1;
"""

pysqldf(P_1)

     name
0  A-Bomb

In [58]:
#¿Cuántas casas publicadoras existen?
P_2 = """
SELECT COUNT(DISTINCT Publisher) 
FROM heroes_information;
"""

pysqldf(P_2)

   COUNT(DISTINCT Publisher)
0                         24

In [59]:
#¿Cuántos superhéroes miden más de 2 metros (200 cms)?
P_3 = """
SELECT COUNT(DISTINCT name) 
FROM heroes_information 
WHERE Height > 200;
"""

pysqldf(P_3)

   COUNT(DISTINCT name)
0                    59

In [60]:
#¿Cuántos superhéroes son humanos y miden más de 2 metros (200 cms)?
P_4 ="""
SELECT COUNT(DISTINCT name)
FROM heroes_information
WHERE Race="Human"
AND Height > 200;
"""
pysqldf(P_4)

   COUNT(DISTINCT name)
0                    12

In [61]:
#¿Cuántos superhéroes pesan más de 100 lbs y menos de 200 lbs?
P_5 = """
SELECT COUNT(DISTINCT name)
FROM heroes_information
WHERE "Weight" BETWEEN 100 AND 200;
"""

pysqldf(P_5)

   COUNT(DISTINCT name)
0                    97

In [62]:
#¿Cuántos superhéroes tienen los ojos de color azul o rojo?
P_6 = """
SELECT COUNT(DISTINCT name)
FROM heroes_information
WHERE "Eye color"="blue" OR "Eye Color"="red";
"""

pysqldf(P_6)

   COUNT(DISTINCT name)
0                   268

In [63]:
#¿Cuántos superhéroes son Human, Mutant y tienen el pelo color Verde o son Vampiros con pelo Negro?
P_7 = """
SELECT COUNT(DISTINCT name)
FROM heroes_information
WHERE Race ="Vampire" 
OR(Race = "Mutant" OR Race = "Human") 
AND "Hair Color"="Black";
"""

pysqldf(P_7)

   COUNT(DISTINCT name)
0                    68

In [64]:
#¿Cuál es el nombre del primer superhéroe si ordeno la tabla por raza en orden descendente?
P_8 = """
SELECT name 
FROM heroes_information
ORDER BY Race DESC
limit 1;
"""
pysqldf(P_8)

             name
0  Solomon Grundy

In [65]:
#¿Cuántos superhéroes son de género masculino y cuántas de género femenino?
P_9 = """
SELECT Gender, COUNT(DISTINCT name) 
FROM heroes_information
GROUP BY Gender;
"""
pysqldf(P_9)

   Gender  COUNT(DISTINCT name)
0    None                    29
1  Female                   198
2    Male                   493

In [66]:
#¿Cuántas casas publicadoras tienen más de 15 superhéroes?
P_10 = """
SELECT Publisher, COUNT(DISTINCT name)
FROM heroes_information
GROUP BY Publisher
HAVING COUNT(DISTINCT name)>15;
"""
pysqldf(P_10)

           Publisher  COUNT(DISTINCT name)
0          DC Comics                   208
1  Dark Horse Comics                    18
2      Marvel Comics                   379
3       NBC - Heroes                    19